print('3 задание 7-ая практическая')
print('')
print('===============================================')
print('==              ⚜️НАШЕ МЕНЮ⚜️                ==')
print('===============================================')
print('')
print(' Позиция       |     Цена       ')
print('1  Кофе ☕     |     120 рублей     ')
print('2  Чай  🫖     |     80 рублей     ')
print('3  Сок 🧃      |     100 рублей      ')
print('4  Вода 💧     |     50 рублей      ')
print('5  Лимонад 🥤  |     90 рублей       ')

print('')
zakaz = input('Укажите напиток по номеру или укажите его название: ').lower()
match zakaz:
    case '1' |'кофе':
        price = 120
        name = 'Кофе'
        kolvo=int(input('Введите количество позиций: '))
        emoji = '☕'
        total = price*kolvo
        discount=str(input('Введите промокод: ')).lower()
        if discount == 'student':
            print ('Промокод успешно активирован!')
        else:
            print ('Неизвестный промокод.')
    case '2' |'чай':
        price = 80
        name = 'Чай'
        kolvo=int(input('Введите колчиество позиций: '))
        emoji='🫖'
        total=price*kolvo
        discount = str(input('Введите промокод: ')).lower()
        if discount == 'student':
            print ('Промокод успешно активирован!')
        else:
            print ('Неизвестный промокод.')
    case '3' |'сок':
        price = 100
        name = 'Сок'
        kolvo = int(input('Введите колчиество позиций: '))
        emoji = '🧃'
        total=price*kolvo
        discount = str(input('Введите промокод: ')).lower()
        if discount == 'student':
            print ('Промокод успешно активирован!')
        else:
            print ('Неизвестный промокод.')
    case '4' |'вода':
        price = 50
        name = 'Вода'
        kolvo = int(input('Введите колчиество позиций: '))
        emoji = '💧'
        total=price*kolvo
        discount = str(input('Введите промокод: ')).lower()
        if discount == 'student':
            print ('Промокод успешно активирован!')
        else:
            print ('Неизвестный промокод.')
    case '5' |'лимонад':
        price = 90
        name= 'лимонад'
        kolvo = int(input('Введите колчиество позиций: '))
        emoji = '🥤'
        total = price * kolvo
        discount = str(input('Введите промокод: ')).lower()
        if discount == 'student':
            print ('Промокод успешно активирован!')
        else:
            print ('Неизвестный промокод.')
    case _:
        print('Ошибка! Неизвестная позиция меню.')

print('')
print('======================================')
print(f'=       {emoji}КВИТАНЦИЯ КАФЕ{emoji}          =')
print('======================================')
print('')
print(f'Товар:{name}{emoji}')
print(f'Цена за порцию: {price}')
print(f'Количество порций: {kolvo} ')
print(f'Сумма: {total}')
if discount == 'student':
    total_fin=total*0.8
    skidka=total*0.2
    print(f'Скидка "STUDENT" (-20%): -{skidka}')
else:
    total_fin=total
print('')
print('========================================')
print(f'💵 ИТОГО К ОПЛАТЕ: {total_fin} ')
print('========================================')


