zakaz=str(input('Введите статус вашего заказа (pending, processing, shipped, delivered, cancelled): '))

match zakaz:
    case 'pending':
        status = 'В ожидании🕖'
        description = 'заказ принят системой и ожидает начала обработки.'
        time_lim = '1-2 часа.'
        recommendations = 'следите за уведомлениями о смене статуса заказа.'
    case 'processing':
        status = 'В обработке ⏳'
        description = 'товар проверяется, резервируется и готовится к отправке.'
        time_lim = '1-3 рабочих дня.'
        recommendations = 'убедитесь, что ваш адрес указан верно, чтобы избежать задержек.'
    case 'shipped':
        status = 'Отправлено🚀'
        description = 'товары переданы службе доставки, отслеживание доступно через трек-код.'
        time_lim = '1-7 рабоих дней.'
        recommendations = 'используйте номер для проверки статуса доставки на сайте транспортной компании.'
    case 'delivered':
        status = 'Доставлено✅'
        description = 'Ваш заказ успешно доставлен по указанному адресу.'
        time_lim = 'доставлен!'
        recommendations = 'проверьте комплектность товара и куачество упаковки.'
    case 'cancelled':
        status = 'Отменено❌'
        description = 'заказа больше не существует, к сожалению он был отменен.'
        time_lim = 'Отменено'
        recommendations = 'свяжитесь с поддержкой, если вы не отменяли заказ.'
    case _:
        print('Ошибка! Неизвестный статус заказа.')

print('')
print('==================================')
print('     📦СТАТУС ВАШЕГО ЗАКАЗА📦    ')
print('==================================')
print('')
print(f'Статус: {status}')
print(f'Описание: {description}')
print(f'Примерное время ожидания {time_lim}')
print(f'Рекомендации: {recommendations}')